import React from "react";
import style from "./welcome.module.css";
import img from "../../img/png-klev-club-p-raskritaya-kniga-png-21.png";

const WelcomeMessage = () => {
  return (
    <section className={style.sectionWelcome}>
      <div className={style.sectionWelcomeImage}>
        <img src={img} alt="book" />
      </div>
      <div className={style.sectionWelcomeContent}>
        <h1>Ласкаво просимо до "Моєї домашьої бібліотеки"</h1>
        <p>
          "Моя домашня бібліотека" - це ваш особистий помічник у керуванні
          книгами. Зручний і простий у використанні, він дозволяє вам легко
          організувати вашу бібліотеку, додавати нові книги, відстежувати їх
          статус доступності та відгуки користувачів.
        </p>
        <h2>Основні можливості :</h2>
        <ul className={style.WelcomeContentList}>
          <li>
            Додавання книг: Швидко додавайте нові книги за допомогою простої.
          </li>
          <li>
            Відстеження статусу: Відстежуйте, які книги доступні для читання, а
            які зараз у запозиченні або очікуються у списку очікування.
          </li>
          <li>
            Відгуки користувачів: Додавайте та переглядайте відгуки про книги,
            які вас цікавлять, та залишайте свої власні коментарі.
          </li>
          <li>
            Сортування та пошук: Зручна можливість сортувати книги за рейтингом,
            а також швидкий пошук за назвою чи автором.
          </li>
        </ul>
        <p>
          Нехай "Моя домашня бібліотека" стане вашим незамінним помічником у
          світі книг!
        </p>
      </div>
    </section>
  );
};

export default WelcomeMessage;
